app/views/notifications/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
					<%= link_to image_tag(notification.user.avatar.url(:thumb), :border=>0, class: 'pic_thumb'), user_path(notification.user) %>
					<span style="font-weight: bold;"><%= notification.user.firstname + " " + notification.user.lastname%> </span> <span>wants to be friend with you.</span>