app/views/users/show.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."id" = ? LIMIT 1  [["id", 4]]
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."friend_id" = 3 AND (status=1)
---
	<div class="span3">
		<h4> <%= @user.friendships.where('status=1').count+ @user.inverse_friendships.where('status=1').count %> Friends</h4>