app/views/shared/_eventfeed.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "events" ("address", "category", "created_at", "description", "from_time", "latitude", "longitude", "name", "post_date", "priority_point", "to_time", "updated_at", "urgency", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
					<div class="fbrtop">
						<span class="username"><%= "#{event.user.firstname.capitalize} #{event.user.lastname.capitalize}" %> </span>
						 <span class="timestamp"> transmitted <%= time_ago_in_words(event.created_at) %> ago </span>

SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = 33
SELECT COUNT(*) FROM "events" WHERE (events.latitude BETWEEN 59.81682635066746 AND 60.68521704933254 AND events.longitude BETWEEN 24.13552339166906 AND 25.88560180833094)
SELECT events.*, (69.09332411348201 * ABS(events.latitude - 60.2510217) * 0.7071067811865475) + (59.836573914187355 * ABS(events.longitude - 25.0105626) * 0.7071067811865475) AS distance, CASE WHEN (events.latitude >= 60.2510217 AND events.longitude >= 25.0105626) THEN 45.0 WHEN (events.latitude < 60.2510217 AND events.longitude >= 25.0105626) THEN 135.0 WHEN (events.latitude < 60.2510217 AND events.longitude < 25.0105626) THEN 225.0 WHEN (events.latitude >= 60.2510217 AND events.longitude < 25.0105626) THEN 315.0 END AS bearing FROM "events" WHERE (events.latitude BETWEEN 59.81682635066746 AND 60.68521704933254 AND events.longitude BETWEEN 24.13552339166906 AND 25.88560180833094) ORDER BY distance ASC
---
				<span style="float:right">
					<%= event.comments.count %> Comments & <%= event.eventjoiners.count %> Joiners