app/views/events/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = 36
---
		<div class="commentDisplay">
			<% @event.comments.each do |item| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
							<div class="commenter">
							<%= item.user.firstname + " " + item.user.lastname %>