app/controllers/comments_controller.rb

	def create
	    @event = Event.find(params[:event_id])
	    @comment = @event.comments.build(params[:comment])
	    @comment.user_id = current_user.id
		@comment.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "36"]]
INSERT INTO "comments" ("comment", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Something. Lets see if it works."], ["created_at", Mon, 18 Mar 2013 18:28:31 UTC +00:00], ["event_id", 36], ["updated_at", Mon, 18 Mar 2013 18:28:31 UTC +00:00], ["user_id", 3]]