app/controllers/eventjoins_controller.rb

INSERT INTO "eventjoins" ("created_at", "eventjoiner_id", "joinedevent_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 23 Mar 2013 17:47:40 UTC +00:00], ["eventjoiner_id", 3], ["joinedevent_id", 62], ["updated_at", Sat, 23 Mar 2013 17:47:40 UTC +00:00]]
---
	def create
		@eventjoin = current_user.eventjoins.build(joinedevent_id: params[:event_id])
		if @eventjoin.save

DELETE FROM "eventjoins" WHERE "eventjoins"."id" = ?  [["id", 4]]
---
	def destroy
		@eventjoin = current_user.eventjoins.find_by_joinedevent_id(params[:id])
		if @eventjoin.destroy