app/controllers/events_controller.rb

INSERT INTO "events" ("address", "category", "created_at", "description", "from_time", "latitude", "longitude", "name", "post_date", "priority_point", "to_time", "updated_at", "urgency", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."event_id" = 35
---
  def create
    @event = current_user.events.build(params[:event])
    if @event.save
      username= @event.user.firstname.capitalize + " " + @event.user.lastname.capitalize
      liveItem = {    "event_id" => "#{@event.id}",
                      "username" => "#{username}",
                      "avatar_url" => "#{@event.user.avatar.url(:thumb)}",
                      "eventTitle" =>  "#{@event.name}",
                      "details" =>  "#{@event.description}",
                      "postTime" =>  "#{time_ago_in_words(@event.created_at)}",
                      "address" => "#{@event.address}",
                      "latitude" =>  "#{@event.latitude}",
                      "longitude" =>  "#{@event.longitude}",
                      "urgency" =>  "#{@event.urgency}",
                      "category" => "#{@event.category}",
                      "comments_count" => "#{@event.comments.count}",
                      "joiners_count" => "#{@event.eventjoiners.count}"

SELECT "events".* FROM "events" WHERE "events"."id" = 36 LIMIT 1
---
  def find_event
    @event = Event.find_by_id(params[:id])