app/controllers/friendships_controller.rb

	def create
		@friendship = current_user.friendships.build(friend_id: params[:id])
		@friendship.status = 0
		if @friendship.save
---
INSERT INTO "friendships" ("created_at", "friend_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 19 Mar 2013 18:30:36 UTC +00:00], ["friend_id", nil], ["status", 0], ["updated_at", Tue, 19 Mar 2013 18:30:36 UTC +00:00], ["user_id", 3]]

	def update
		@inverse_friendship = current_user.inverse_friendships.find_by_user_id(params[:id])
		if @inverse_friendship.update_attribute(:status, 1 )
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 3 AND "friendships"."user_id" = 4 LIMIT 1
UPDATE "friendships" SET "status" = 1, "updated_at" = '2013-03-21 09:15:21.776954' WHERE "friendships"."id" = 6

	def destroy
		@friendship = current_user.friendships.find_by_friend_id(params[:id])
		@inverse_friendship = current_user.inverse_friendships.find_by_user_id(params[:id])
		if !@friendship.nil? && @inverse_friendship.nil?
			if @friendship.destroy
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 4 LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 2]]