app/controllers/home_controller.rb

SELECT events.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((60.2510217 - events.latitude) * PI() / 180 / 2), 2) + COS(60.2510217 * PI() / 180) * COS(events.latitude * PI() / 180) * POWER(SIN((25.0105626 - events.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(events.longitude - 25.0105626), RADIANS(events.latitude - 60.2510217))) + 360 AS decimal) % 360 AS bearing FROM `events` WHERE (events.latitude BETWEEN 59.81682635066746 AND 60.68521704933254 AND events.longitude BETWEEN 24.13552339166906 AND 25.88560180833094 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((60.2510217 - events.latitude) * PI() / 180 / 2), 2) + COS(60.2510217 * PI() / 180) * COS(events.latitude * PI() / 180) * POWER(SIN((25.0105626 - events.longitude) * PI() / 180 / 2), 2))) <= 30) ORDER BY created_at DESC, distance ASC LIMIT 30
---
  def index
  	@event= Event.new
  	@events = Event.order('created_at DESC').limit(30).near("malmi helsinki", 30).all