app/controllers/notifications_controller.rb

  def index
  	@notifications = current_user.inverse_friendships.where(status: 0)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 3 AND "friendships"."status" = 0