app/controllers/users_controller.rb

  def create
   @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "firstname", "ip", "lastname", "password_digest", "remember_cookie", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)